public class FloatNumber {
    /*
        精确表达浮点数
        将有限小数/无限循环小数转化为分数，可能输入类型：0.3, 0.30, 0.3(000), 0.333(333)...
        不妨只考虑 (0, 1) 之间的纯小数，则 X=0.a1a2...an，X=0.a1a2...an(b1b2...bm)。
        1、X=0.a1a2...an 时，X=(a1a2...an)/10^n。
        2、X=0.a1a2...an(b1b2...bm)，做如下转换：
                 X = 0.a1a2...an(b1b2...bm)
            10^n*X = a1a2...an.(b1b2...bm)
            10^n*X = a1...an + 0.b1...bm
                 X = (a1...an + 0.b1...bm)/10^n         (1)
           整数部分不需额外处理，在观察 Y=0.b1b2...bm
                 Y = 0.b1b2...bm
            10^m*Y = b1b2...bm + 0.b1b2...bm
        (10^m-1)*Y = b1b2...bm
                 Y = (b1b2...bm)/(10^m-1)               (2)
           合并(1)(2)，
                 X = (a1...an + Y)/10^n
                   = (a1...an + b1...bm/(10^m-1))/10^n
                   = (a1...an * (10^m-1) + b1...bm)/((10^m-1)*10^n)
           至此，在将 A/B 根据最大公约数化简 A/B = (A/gcd(A, B))/(B/gcd(A, B))即可。
     */
}
